{
  "architectures": [
    "LlamaForCausalLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.0,
  "bos_token_id": 128000,
  "eos_token_id": [
    128001,
    128008,
    128009
  ],
  "hidden_act": "silu",
  "hidden_size": 4096,
  "initializer_range": 0.02,
  "intermediate_size": 14336,
  "max_position_embeddings": 131072,
  "mlp_bias": false,
  "model_type": "llama",
  "num_attention_heads": 32,
  "num_hidden_layers": 32,
  "num_key_value_heads": 8,
  "pretraining_tp": 1,
  "rms_norm_eps": 1e-05,
  "rope_scaling": {
    "factor": 8.0,
    "low_freq_factor": 1.0,
    "high_freq_factor": 4.0,
    "original_max_position_embeddings": 8192,
    "rope_type": "llama3"
  },
  "rope_theta": 500000.0,
  "tie_word_embeddings": false,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.42.3",
  "use_cache": true,
  "vocab_size": 128256,
  "rank": 4096,
  "layer_step": 16,
  "head_wise_ranks": {
    "model.layers.0.self_attn.v_proj": [
      4096
    ],
    "model.layers.1.self_attn.v_proj": [
      4096
    ],
    "model.layers.2.self_attn.v_proj": [
      4096
    ],
    "model.layers.3.self_attn.v_proj": [
      4096
    ],
    "model.layers.4.self_attn.v_proj": [
      4096
    ],
    "model.layers.5.self_attn.v_proj": [
      4096
    ],
    "model.layers.6.self_attn.v_proj": [
      4096
    ],
    "model.layers.7.self_attn.v_proj": [
      4096
    ],
    "model.layers.8.self_attn.v_proj": [
      4096
    ],
    "model.layers.9.self_attn.v_proj": [
      4096
    ],
    "model.layers.10.self_attn.v_proj": [
      4096
    ],
    "model.layers.11.self_attn.v_proj": [
      4096
    ],
    "model.layers.12.self_attn.v_proj": [
      3936
    ],
    "model.layers.13.self_attn.v_proj": [
      3936
    ],
    "model.layers.14.self_attn.v_proj": [
      3936
    ],
    "model.layers.15.self_attn.v_proj": [
      3936
    ],
    "model.layers.16.self_attn.v_proj": [
      3072
    ],
    "model.layers.17.self_attn.v_proj": [
      3072
    ],
    "model.layers.18.self_attn.v_proj": [
      3072
    ],
    "model.layers.19.self_attn.v_proj": [
      3072
    ],
    "model.layers.20.self_attn.v_proj": [
      2112
    ],
    "model.layers.21.self_attn.v_proj": [
      2112
    ],
    "model.layers.22.self_attn.v_proj": [
      2112
    ],
    "model.layers.23.self_attn.v_proj": [
      2112
    ],
    "model.layers.24.self_attn.v_proj": [
      2176
    ],
    "model.layers.25.self_attn.v_proj": [
      2176
    ],
    "model.layers.26.self_attn.v_proj": [
      2176
    ],
    "model.layers.27.self_attn.v_proj": [
      2176
    ],
    "model.layers.28.self_attn.v_proj": [
      2688
    ],
    "model.layers.29.self_attn.v_proj": [
      2688
    ],
    "model.layers.30.self_attn.v_proj": [
      2688
    ],
    "model.layers.31.self_attn.v_proj": [
      2688
    ]
  }
}
